In [1]:
import numpy as np
import pandas as pd

¿Qué diferencia hay entre una Serie y un DataFrame?

La serie solo tiene una dimensión, en cambio el Data Frame tiene 2 o más dimensiones y por lo tanto tiene más columnas con información.

Momento de trabajar con Series. Contestad a las siguientes preguntas:
Crea dos listas:
- Una que se llame "valores" que tenga 7 números aleatorios.
- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [13]:
valores = [1,78,93,45,10,22,54]
indices = ["lunes", "martes", "miércoles", "jueves", "viernes", "sábado", "domingo"]

Cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [14]:
serie1 = pd.Series(valores, index = indices)
serie1

lunes         1
martes       78
miércoles    93
jueves       45
viernes      10
sábado       22
domingo      54
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto usar el método zip.

In [46]:
dic = zip(indices, valores)
dic2 = list(dic)
dic2

In [45]:
dic1 = {}
for i in dic2:
    dic1.update({i[0]:i[1]})

dic1

{'lunes': 1,
 'martes': 78,
 'miércoles': 93,
 'jueves': 45,
 'viernes': 10,
 'sábado': 22,
 'domingo': 54}

Crea una Serie con el diccionario creado en el punto anterior.

In [47]:
serie2 = pd.Series(dic1)
serie2

lunes         1
martes       78
miércoles    93
jueves       45
viernes      10
sábado       22
domingo      54
dtype: int64

Extraer forma, tipo, tamaño, índices y values de la serie:

In [48]:
print(f'La forma de la serie es: {serie2.shape}')
print(f'El tipo de dato de la serie es: {serie2.dtype}')
print(f'EL tamaño de la serie es: {serie2.size}')
print(f'Los índices de la serie son: {serie2.index}')
print(f'Los values de la serie son: {serie2.values}')

La forma de la serie es: (7,)
El tipo de dato de la serie es: int64
EL tamaño de la serie es: 7
Los índices de la serie son: Index(['lunes', 'martes', 'miércoles', 'jueves', 'viernes', 'sábado',
       'domingo'],
      dtype='object')
Los values de la serie son: [ 1 78 93 45 10 22 54]

Extraer el valor para lunes, para lunes, martes y miercoles, y para lunes y domingo:

In [78]:
# Solución usando los índices

print(serie2[0])
print(serie2[:3])
print(serie2[0:7:6])

1
lunes         1
martes       78
miércoles    93
dtype: int64
lunes       1
domingo    54
dtype: int64

In [80]:
#Solución usando .loc

print(serie2.loc[["lunes"]])
print(serie2.loc[["lunes","martes","miércoles"]])
print(serie2.loc[["lunes","domingo"]])

lunes         1
martes       78
miércoles    93
dtype: int64

Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [49]:
arr1 = np.random.rand(4,3)
arr1

array([[0.10744695, 0.37750371, 0.39021432],
       [0.75499707, 0.88331638, 0.63653144],
       [0.80750503, 0.87800294, 0.16554263],
       [0.54825784, 0.65252474, 0.44238623]])

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [51]:
paises = pd.DataFrame(arr1, columns = ['España', 'Francia', 'Italia'])
paises

     España   Francia    Italia
0  0.107447  0.377504  0.390214
1  0.754997  0.883316  0.636531
2  0.807505  0.878003  0.165543
3  0.548258  0.652525  0.442386

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

In [53]:
df = pd.read_csv("medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el loc extraed todas las columnas de la fila.
- Usando el loc extraed todas las columnas de China e Irán.
- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
- Usando el iloc extraed la información de la India. Devolved todas las columnas.
- Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
- Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [55]:
df.loc[:]

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [60]:
df.loc[["China", "Irán"], :]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [61]:
df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [64]:
df.iloc[5]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [65]:
df.iloc[1:10:2]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [67]:
df.iloc[1:10:2, 1:4]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Qué país consiguió más de 200 medallas de oro?

In [68]:
df.loc[df.Oro > 200, :]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [73]:
df.loc[(df.Oro > 200) & (df.Plata > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [74]:
df.loc[(df.Oro > 200) & (df.Bronce > 700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [87]:
df.drop(columns = "Unnamed: 0")

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [89]:
df.assign(total=df['Oro']+ df['Plata']+ df['Bronce'])

                 Unnamed: 0   Oro  Plata  Bronce  total
País
China                     1  1473    994     720   3187
Japón                     2  1032   1037     985   3054
Corea del Sur             3   745    663     827   2235
Irán                      4   179    181     197    557
Kazajistán                5   155    158     224    537
India                     6   154    202     315    671
Tailandia                 7   132    175     278    585
Indonesia                 8   112    131     240    483
China Taipéi              9    99    144     276    519
Corea del Norte          10    91    120     235    446